Revit 2024 API
SolidGeometryOptions.SolidTag Property
 Optional solid tag for the Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public int SolidTag { get; set; }
Visual Basic
Public Property SolidTag As Integer
	Get
	Set
Visual C++
public:
property int SolidTag {
	int get ();
	void set (int value);
}
See Also
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace